work/WinVent/Kastenfenster/V02/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1; //0.1

vertices
(
    (-15 -15 -0.1)
    (15 -15 -0.1)
    (15 20 -0.1)
    (-15 20 -0.1)
    (-15 -15 15.1)
    (15 -15 15.1)
    (15 20 15.1)
    (-15 20 15.1)
);

blocks
(
     hex (0 1 2 3 4 5 6 7) (60 70 30) simpleGrading (1 1 1)
);

defaultPatch
{
    type patch;
}

boundary
(
);


// ************************************************************************* //
