work/WinVent/Kastenfenster/V02/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.00003971;

bcField uniform 0.00000000001;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
	type            calculated;
        value           $bcField; //$internalField;
    }

    staticWalls
    {
        
	    type            compressible::alphatJayatillekeWallFunction;
        Prt            	0.85;
        value           $bcField; 
    }

    glass_master
    {
        $staticWalls;
    }

    glass_slave
    {
        $glass_master;
    }
	
	
    movingWalls
    {
	$staticWalls;
    }

    nonCouple
    {
        type            zeroGradient;
    }

    ".*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
