work/WinVent/Kastenfenster/V02/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00015;
bcField uniform 0.00000000001;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $inletValue;
    }

    staticWalls
    {
        //type            zeroGradient; 
	type            kqRWallFunction;
        value           $internalField;
    }

    glass_master
    {
        $staticWalls;
    }

    glass_slave
    {
        $glass_master;
    }

    movingWalls
    {
        $staticWalls;
    }

    nonCouple
    {
        type            zeroGradient;
    }

    ".*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
