work/WinVent/Kastenfenster/V02/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/initialisationConditions"


regions
(
    boxToCell
    {
        box (0.73 -1.202 0) (2.730 -0.202 5);
        fieldValues
        (
            volScalarFieldValue T $!atmosphere/T
            volScalarFieldValue CO2 $!atmosphere/CO2
            volScalarFieldValue Y_CO2 $!atmosphere/Y_CO2
            volScalarFieldValue specificHumidity $!atmosphere/specificHumidity
        );
    }
    /*
    boxToCell
    {
        box (-4.15 6.1 0) (5.85 16.2 10);
        fieldValues
        (
            volScalarFieldValue T $!atmosphere/T
            volScalarFieldValue CO2 $!atmosphere/CO2
            volScalarFieldValue Y_CO2 $!atmosphere/Y_CO2
            volScalarFieldValue specificHumidity $!atmosphere/specificHumidity
        );
    } */


);


// ************************************************************************* //
